//-----------------------------------------------------------------
// 程序描述:
//     DMA驱动程序
// 作    者: 凌智电子
// 开始日期: 2018-08-04
// 完成日期: 2018-08-04
// 修改日期: 
// 当前版本: V1.0
// 历史版本:
//  - V1.0: (2018-08-04)DMA配置和传输
// 调试工具: 凌智STM32F429+CycloneIV电子系统设计开发板、LZE_ST_LINK2
// 说    明: 
//    
//-----------------------------------------------------------------
#ifndef __DMA_H
#define __DMA_H
#include "stm32f429_winner.h"
//-----------------------------------------------------------------
// 声明
//-----------------------------------------------------------------
extern DMA_HandleTypeDef  ADC1DMA_Handler;      // DMA句柄

//-----------------------------------------------------------------
// 函数声明
//-----------------------------------------------------------------
extern void MYDMA_Config(DMA_Stream_TypeDef *DMA_Streamx,u32 chx);
extern void MYDMA_ADC_Transmit(ADC_HandleTypeDef *hadc, uint32_t *pData, uint16_t Size);

#endif
//-----------------------------------------------------------------
// End Of File
//----------------------------------------------------------------- 
